# Отсортируйте по убыванию методом пузырька одномерный целочисленный массив, заданный случайными числами
# на промежутке [-100; 100). Выведите на экран исходный и отсортированный массивы.
# Примечания:
# ● алгоритм сортировки должен быть в виде функции, которая принимает на вход массив данных,
# ● постарайтесь сделать алгоритм умнее, но помните, что у вас должна остаться сортировка пузырьком.
# Улучшенные версии сортировки, например, расчёской, шейкерная и другие в зачёт не идут.

import random

def bubble_sort(array):

    n = 1
    while n < len(array):
        change = False
        for i in range(len(array) - 1):
            if array[i] < array[i + 1]:
                array[i], array[i + 1] = array[i + 1], array[i]
                change = True
        n += 1
        if change == False:
            return array

    return array

array = [random.randint(-100, 99) for i in range(10)]
print("Исходный массив:\n", array)
print("\nОтсортированный массив:\n", bubble_sort(array))
